7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
    if (countL0 == MaxHistoryL0) {
      if (!headL0) {
        if (countL1 == SensorSlice::MaxRecords) {
          flushL1L2();
        }
        sliceL1.records[countL1++] = recordsL0[0];
      }
      current = headL0;
      headL0 = (headL0 + 1) & RingMaskL0;
    } else {
      current = (headL0 + countL0++) & RingMaskL0;
    }

    record = recordsL0 + current;

    millisLast = millisCurrent;
    record->timestamp = secondsLast = secondsCurrent;
    record->humidInt = dht.data[0];
    record->humidDot = dht.data[1];
    record->tempInt =  static_cast<int8_t>(dht.data[2]);
    record->tempDot = dht.data[3];
  }

  void firstFetchAppend(uint32_t const millisCurrent) {
    dht.begin();
    fetchAppend(millisCurrent / 1000, millisCurrent);
  }

  void maybeFetchAppend(uint32_t const millisCurrent) {
    uint32_t const millisElasped = millisCurrent - millisLast;

    if (millisElasped >= 2000) {
      if (millisCurrent < millisLast) { /* overflow */
        /* UINT32_MAX = 0xFFFFFFFF = 4294967295 */
        secondsOffset += 4294967;
        millisOffset += 295;
        while (millisOffset >= 1000) {
          millisOffset -= 1000;
          secondsOffset += 1;
        }
      }
      fetchAppend(secondsOffset + (millisCurrent + millisOffset) / 1000, millisCurrent);
    }
  }
};

static SensorHistory history = {};

void httpHandleLast() {
  int i, r, offset, remain;
  int const countArgs = server.args();
  SensorRecord &record = history.last();
  char buffer[SensorRecord::lenBufferShort];

  if (countArgs > 0) {
    offset = 0, remain = SensorRecord::lenBufferShort;
    buffer[1] = '\0';
    for (i = 0; i < countArgs; ++i) {
      String const &argName = server.argName(i);
      if (argName.startsWith("temp")) {
        r = snprintf(buffer + offset, remain, ",%" PRId8 ".%" PRIu8, record.tempInt, record.tempDot);
      } else if (argName.startsWith("humid")) {
        r = snprintf(buffer + offset, remain, ",%" PRIu8 ".%" PRIu8, record.humidInt, record.humidDot);
      } else {
        continue;
      }
      if (r < 0) {
        serverSendError(StringFormatFailure);
        return;
      }
      if (r >= remain) {
        serverSendError(StringWouldTruncate);
        return;
      }
      offset += r;
      remain -= r;
    }
    server.send(200, "text/plain", buffer + 1, offset - 1);
  } else {
    r = snprintf(buffer, SensorRecord::lenBufferShort, "%" PRId8 ".%" PRIu8 ",%" PRIu8 ".%" PRIu8 "", record.tempInt, record.tempDot, record.humidInt, record.humidDot);
    if (r < 0) {
      serverSendError(StringFormatFailure);
      return;
    }
    if (r >= SensorRecord::lenBufferShort) {
      serverSendError(StringWouldTruncate);
    }
    server.send(200, "text/plain", buffer, r);
  }
}

void httpHandleNotFound() {
  server.send_P(404, "text/plain", ErrorNotFound, sizeof(ErrorNotFound) - 1);
}

bool serverIsAuthorized() {
  static String const AuthExpected = String("Bearer " PRIVATE_PC_AUTH);
  static String const HeaderAuthorization = String("Authorization");

  if (!server.hasHeader(HeaderAuthorization)) {
    return false;
  }

  return server.header(HeaderAuthorization) == AuthExpected;
}

void pulseButton(uint8_t const pin) {
  digitalWrite(pin, HIGH);
  delay(250);
  digitalWrite(pin, LOW);
}

void httpHandlePcPower() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinPower);
  server.send_P(200, "text/plain", PcPowerOk, sizeof(PcPowerOk) - 1);
}

void httpHandlePcReset() {
  if (!serverIsAuthorized()) {
    httpHandleNotFound();
    return;
  }

  pulseButton(PcPinReset);
  server.send_P(200, "text/plain", PcResetOk, sizeof(PcResetOk) - 1);
}

#ifdef PRIVATE_ALLOW_CROSS
void serverSendHeadersForRaw() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Cache-Control", "no-store");
}
#endif

struct RawAllSender {
  COMPCONST size_t const lenBuffer = 1024;
  COMPCONST size_t const lenMax = lenBuffer - SensorRecord::lenBuffer;

  char buffer[lenBuffer];
  size_t len;
  size_t offset = 0;

  RawAllSender() {
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", "", 0);
  }

  void sendRecord(uint64_t const unixOffset, SensorRecord const &record) {
    if (record.intoStr(unixOffset, buffer + offset, len)) {
      if ((offset += len) >= lenMax) {
        server.sendContent(buffer, offset);
        offset = 0;
      }
    }
  }

  void sendRingRecords(SensorRecord const *records, uint8_t const head, uint8_t const count) {
    uint64_t const unixOffset = ntpSyncer.unixOffset;
    uint8_t i;

    for (i = head; i < count; ++i) {
      sendRecord(unixOffset, records[i]);
    }
    for (i = 0; i < head; ++i) {
      sendRecord(unixOffset, records[i]);
    }
  }

  void sendPartialSlice(SensorSlice const &slice, uint16_t const count) {
    uint64_t const unixOffset = ntpSyncer.unixOffset;
    uint16_t i;

    for (i = 0; i < count; ++i) {
      sendRecord(unixOffset, slice.records[i]);
    }
  }

  void sendFullSlice(SensorSlice const &slice) {
    uint64_t const unixOffset = slice.unixOffset;
    uint16_t i;

    /* maybe this would use immediate number in instruction, so dont call sendPartialSlice lazily */
    for (i = 0; i < SensorSlice::MaxRecords; ++i) {
      sendRecord(unixOffset, slice.records[i]);
    }
  }

  ~RawAllSender() {
    if (offset) {
      server.sendContent(buffer, offset);
    }
    server.sendContent("", 0);
  }
};

void httpHandleRawAll() {
  uint16_t i;

  RawAllSender sender = {};

  if (history.countL2 > 0) {
    for (i = history.headL2; i < history.countL2; ++i) {
      if (!history.fetchL2(i)) {
        continue;
      }
      sender.sendFullSlice(history.sliceL2);
    }
    for (i = 0; i < history.headL2; ++i) {
      if (!history.fetchL2(i)) {
        continue;
      }
      sender.sendFullSlice(history.sliceL2);
    }
  }
  if (history.countL1 > 0) {
    sender.sendPartialSlice(history.sliceL1, history.countL1);
  }
  if (history.countL0 > 0) {
    sender.sendRingRecords(history.recordsL0, history.headL0, history.countL0);
  }
}

void httpHandleRawLast() {
  char buffer[SensorRecord::lenBuffer];
  size_t len;

  if (history.last().intoStr(ntpSyncer.unixOffset, buffer, len)) {
#ifdef PRIVATE_ALLOW_CROSS
    serverSendHeadersForRaw();
#endif
    server.send(200, "text/plain", buffer, len);
  }
}

void httpHandleRoot() {
  server.send_P(200, "text/html; charset=utf-8", RootPage, sizeof(RootPage) - 1);
}

void setup() {
  static String const wantedSSID = String(ConfigWiFiSSID);

  bool recoverFlash = false;
  int8_t countNetworks, bestScanID;
  uint8_t i, *currentBSSID;
  int32_t bestRSSI, currentRSSI, currentChannel;
  uint32_t millisCurrent;
  String currentSSID;

  pinMode(PcPinPower, OUTPUT);
  digitalWrite(PcPinPower, LOW);
  pinMode(PcPinReset, OUTPUT);
  digitalWrite(PcPinReset, LOW);

  Serial.begin(ConfigBaudRate);
  WiFi.setHostname(ConfigHostName);
  WiFi.setAutoReconnect(true);

